Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЗаписиКОповещению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЗаписиКОповещению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/омг_НастройкиИнтеграцииСЛИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>омг_НастройкиИнтеграцииСЛИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПозицииИсключенияИзОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПозицииИсключенияИзОповещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Заявка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>омг_БезЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_БезЗаписиНесколькоВрачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_УниверсальныеОбработчикиВызовСервера/Ext/Module.bsl
Функция СформироватьКодВставкиЗапросаНаСервере(СсылкаНаЗапрос) Экспорт
    
    КодЗапроса = СсылкаНаЗапрос.Код;
    
    // Собираем поля в одну красивую строку через запятую
    МассивПолей = Новый Массив;
    Для Каждого СтрПоле Из СсылкаНаЗапрос.Поля Цикл
        МассивПолей.Добавить(СтрПоле.ИмяПоля);
    КонецЦикла;
    СтрокаПолей = СтрСоединить(МассивПолей, ", ");
    
    // Начинаем сборку итогового кода
    МассивСтрокКода = Новый Массив;
    МассивСтрокКода.Добавить("Запрос = Новый Запрос;");
    МассивСтрокКода.Добавить("Запрос.Текст = ТекстЗапроса(""" + КодЗапроса + """);");
    
    Если Не ПустаяСтрока(СтрокаПолей) Тогда
        МассивСтрокКода.Добавить("// Доступные поля: " + СтрокаПолей);
    КонецЕсли;
    
    // Генерируем строки установки параметров
    Для Каждого СтрПар Из СсылкаНаЗапрос.Параметры Цикл
        МассивСтрокКода.Добавить("Запрос.УстановитьПараметр(""" + СтрПар.ИмяПараметра + """, Неопределено);");
    КонецЦикла;
    
    // Соединяем с учетом переносов строк (Символы.ПС)
    Возврат СтрСоединить(МассивСтрокКода, Символы.ПС);
    
КонецФункции

Функция НоваяЗапись(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЗаписиКОповещению.Заявка КАК Заявка,
	               |	iga_ЗаписиКОповещению.Выполнено КАК Выполнено
	               |ИЗ
	               |	РегистрСведений.iga_ЗаписиКОповещению КАК iga_ЗаписиКОповещению
	               |ГДЕ
	               |	iga_ЗаписиКОповещению.Заявка = &Заявка
	               |	И iga_ЗаписиКОповещению.Выполнено";
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ВключеноОповещениеОЗаписи() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Включено = Константы.iga_ВключеноОповещениеОЗаписи.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Включено;
	
КонецФункции


Функция ЕстьЗаписиДляОповещения(Заявка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_НастройкиЛИС
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПозицииИсключенияИзОповещений.Номенклатура
	               |ИЗ
	               |	РегистрСведений.iga_ПозицииИсключенияИзОповещений КАК iga_ПозицииИсключенияИзОповещений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаРаботы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	               |	ЗаявкаРаботы.НомерСтроки КАК НомерСтроки,
	               |	ЗаявкаРаботы.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаявкаРаботы.Ссылка КАК Ссылка
	               |		ИЗ
	               |			Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |		ГДЕ
	               |			ЗаявкаРаботы.Ссылка = &Ссылка
	               |			И ЗаявкаРаботы.НомерСтроки = 1
	               |			И ЗаявкаРаботы.Номенклатура.Ссылка ЕСТЬ NULL) КАК ПерваяПустаяСтрока
	               |		ПО (ИСТИНА),
	               |	(ВЫБРАТЬ
	               |		МАКСИМУМ(ЗаявкаРаботы.НомерСтроки) КАК НомерСтроки
	               |	ИЗ
	               |		Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |	ГДЕ
	               |		ЗаявкаРаботы.Ссылка = &Ссылка) КАК ПоследняяСтрока
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ПоследняяСтрока.НомерСтроки > 1
	               |				ТОГДА НЕ ЗаявкаРаботы.Номенклатура = &ПустаяНоменклатура
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ЗаявкаРаботы.Ссылка = &Ссылка
	               |	И (НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |				И НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
	               |			ИЛИ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |				И НЕ ЗаявкаРаботы.Ссылка.омг_БезЗаписи)
	               |	И НЕ ЗаявкаРаботы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_НастройкиЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_НастройкиЛИС КАК ВТ_НастройкиЛИС)
	               |	И ВЫБОР
	               |			КОГДА ЗаявкаРаботы.омг_Набор.Ссылка ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ НЕ ЗаявкаРаботы.омг_Набор В ИЕРАРХИИ
	               |						(ВЫБРАТЬ
	               |							ВТ_НастройкиЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |						ИЗ
	               |							ВТ_НастройкиЛИС КАК ВТ_НастройкиЛИС)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |				ТОГДА ЗаявкаРаботы.ДатаНачала
	               |			ИНАЧЕ ЗаявкаРаботы.Ссылка.ДатаНачала
	               |		КОНЕЦ > &ТекущаяДата
	               |	И ВЫБОР
	               |			КОГДА ПоследняяСтрока.НомерСтроки = 1
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА НЕ ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |							И НЕ ПерваяПустаяСтрока.Ссылка ЕСТЬ NULL
	               |						ТОГДА ЗаявкаРаботы.НомерСтроки = 2
	               |					КОГДА ЗаявкаРаботы.Ссылка.НесколькоСотрудников
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЗаявкаРаботы.НомерСтроки = 1
	               |				КОНЕЦ
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли Выборка.Количество() > 1 Тогда
		СообщениеБезПодробностей = Истина;
	Иначе
		СообщениеБезПодробностей = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СообщениеБезПодробностей;
	
КонецФункции

Функция ПолучитьДанныеДляОтправки(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей, ЛОЖЬ) КАК омг_БезЗаписиНесколькоВрачей,
	               |	Заявка.Филиал КАК Филиал,
	               |	Заявка.НесколькоСотрудников КАК НесколькоСотрудников,
	               |	Заявка.омг_БезЗаписи КАК омг_БезЗаписи,
	               |	Заявка.Проведен КАК Проведен,
	               |	Заявка.Клиент КАК Клиент,
	               |	Заявка.ДатаНачала КАК ДатаНачала,
	               |	Заявка.Состояние КАК Состояние,
	               |	Заявка.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |		ПО (ЗаявкаРаботы.Ссылка = Заявка.Ссылка)
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	омг_БезЗаписиНесколькоВрачей";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СтруктураЗаявки = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураЗаявки.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	КонецЦикла;
	
	Возврат СтруктураЗаявки;
	
КонецФункции
